---
kind: other
id: Methods.T:Autodesk.Revit.DB.GuidEnum
source: html/60ab1d55-1e5c-b3ab-d5c1-3661f39f326f.htm
---
# GuidEnum Methods

Compares two Guid-based enum object based on their concrete class and GUID value.